application/jmgtcc/backend/controllers/TourDealsController.php

    public function actionCreate()
    {
        $model = new TourDeals();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `tour_deals` (`deal_name`, `deal_description`) VALUES ('Adventure  Tour', '')