application/jmgtcc/frontend/views/traveltourarrangement/_form.php

                    <p class="form-label">Airline</p>
                </div>
                <div class="col-lg-3">
                    <?= $form->field($model, 'airlines_id')->dropDownList(
                    ArrayHelper::map(Airlines::find()->all(),'id','airline_name'),
                    ['prompt'=>'Select Airlines']) ->label(false) ?>
---
SELECT * FROM `airlines`

                    <p class="form-label">Hotel Name</p>
                </div>
                <div class="col-lg-3">
                    <?= $form->field($model, 'hotels_id')->dropDownList(
                        ArrayHelper::map(Hotels::find()->all(),'id', 'hotel_name'),
                        ['prompt'=>'Select Hotel'])->label(false) ?>
---
SELECT * FROM `hotels`