application/jmgtcc/frontend/views/travelarrangement/_form.php

                    <p class="form-label">Accommodation</p>
                 </div>
                <div class="col-lg-3">
                    <?= $form->field($model, 'accommodation')->dropDownList(
                    ArrayHelper::map(Accommodation::find()->all(),'id', 'accommodation_name'),
                   ['prompt'=>'Select Accommodation'])->label(false)   ?>
---
SELECT * FROM `accommodation`

                    <p class="form-label">Tour Deals</p>
                 </div>
                <div class="col-lg-3">
                   <?= $form->field($model, 'tour_deals')->dropDownList(
                  ArrayHelper::map(TourDeals::find()->all(),'id', 'deal_name'),
                  ['prompt'=>'Select Tour Deals'])->label(false)   ?>
---
SELECT * FROM `tour_deals`