application/jmgtcc/common/models/User.php

SELECT * FROM `user` WHERE (`id` IN (1, 1)) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);