application/jmgtcc/frontend/controllers/AppointmentController.php

    public function actionCreate()
    {
        $model = new Appointment();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `appointment` (`client_name`, `city`, `contact_number`, `email_address`, `country`, `visa_type`, `appointment_date`, `appointment_time`, `notes`, `appointment_code`, `client_username`, `payment_rate`, `date_created`, `status`, `confirmed_by`, `user_id`, `staff_id`) VALUES ('Arianne Bianca Papna', 'Taguig City', '+639999999999', 'abby@abby.com', 'Korea', 'Non-Immigrant Visa', '2015-03-18', '03:00:00', 'Hey.', 'Appntmnt Code', '', NULL, NULL, 'For Approval', '', NULL, NULL)

    protected function findModel($id)
    {
        if (($model = Appointment::findOne($id)) !== null) {
---
SELECT * FROM `appointment` WHERE `id`='3'