application/jmgtcc/frontend/controllers/TravelArrangementController.php

SELECT * FROM `travel_arrangement` WHERE (`id`='2') AND (`hotels_id`='1') AND (`airlines_id`='1')
---
    protected function findModel($id, $hotels_id, $airlines_id)
    {
        if (($model = TravelArrangement::findOne(['id' => $id, 'hotels_id' => $hotels_id, 'airlines_id' => $airlines_id])) !== null) {