application/jmgtcc/backend/models/Staff.php

SELECT * FROM `staff` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne($id);

SELECT * FROM `staff` WHERE `username`='staff1'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);