application/jmgtcc/frontend/views/appointment/_form.php

                    <p class="form-label required-field">Appointment Time</p>
                 </div>
                <div class="col-lg-3">
                   <?= $form->field($model, 'appointment_time')->radioList(
                        ArrayHelper::map(Time::find()->all(),'time','description')
                        )
                   ->label(false);
---
SELECT * FROM `time`