application/jmgtcc/frontend/views/tourarrangement/_form.php

            <p class="form-label">Hotel Name</p>
        </div>
        <div class="col-lg-4">
            <?= $form->field($model, 'hotel_name')->dropDownList(
                ArrayHelper::map(Hotels::find()->all(),'id','hotel_name'),
                ['prompt'=>'Select Hotel']) ->label(false) ?>
---
SELECT * FROM `hotels`